In [ ]:
import pandas as pd

In [ ]:
# customer_details
df1 = pd.read_csv('.\customer_details.csv')
# customer Policy details
df2 = pd.read_csv('.\customer_policy_details.csv')

In [ ]:
df1

               0       1     2    3     4    5          6    7
0            1.0    Male  44.0  1.0  28.0  0.0  > 2 Years  Yes
1            2.0    Male  76.0  1.0   3.0  0.0   1-2 Year   No
2            3.0    Male  47.0  1.0  28.0  0.0  > 2 Years  Yes
3            4.0    Male  21.0  1.0  11.0  1.0   < 1 Year   No
4            5.0  Female  29.0  1.0  41.0  1.0   < 1 Year   No
...          ...     ...   ...  ...   ...  ...        ...  ...
381104  381105.0    Male  74.0  1.0  26.0  1.0   1-2 Year   No
381105  381106.0    Male  30.0  1.0  37.0  1.0   < 1 Year   No
381106  381107.0    Male  21.0  1.0  30.0  1.0   < 1 Year   No
381107  381108.0  Female  68.0  1.0  14.0  0.0  > 2 Years  Yes
381108  381109.0    Male  46.0  1.0  29.0  0.0   1-2 Year   No

[381109 rows x 8 columns]

In [ ]:
df2

               0        1      2      3    4
0            1.0  40454.0   26.0  217.0  1.0
1            2.0  33536.0   26.0  183.0  0.0
2            3.0  38294.0   26.0   27.0  1.0
3            4.0  28619.0  152.0  203.0  0.0
4            5.0  27496.0  152.0   39.0  0.0
...          ...      ...    ...    ...  ...
381104  381105.0  30170.0   26.0   88.0  0.0
381105  381106.0  40016.0  152.0  131.0  0.0
381106  381107.0  35118.0  160.0  161.0  0.0
381107  381108.0  44617.0  124.0   74.0  0.0
381108  381109.0  41777.0   26.0  237.0  0.0

[381109 rows x 5 columns]

# 1. Add the column names to both datasets:
## i. Column Name for customer details table:

###           customer_id,

###           Gender,

###           age,

###           driving licence present,

###           region code,

###           previously insured,

###           vehicle age

###           and vehicle damage, in respective order.

In [ ]:
df1.columns = ['customer_id','Gender','age','driving licence present','region code','previously insured','vehicle age','vehicle damge']

In [ ]:
df1

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No
...,...,...,...,...,...,...,...,...
381104,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,No
381105,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,No
381106,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,No
381107,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes
381108,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,No

## ii. Column Name for customer_policy table:

###           customer_id,

###           annual premium (in Rs),

###           sales channel code,

###           vintage and response.

In [ ]:
df2.columns = ['customer_id','annual premimum (in Rs)','sales channel code','vintage','response']

In [ ]:
df2

,customer_id,annual premimum (in Rs),sales channel code,vintage,response
0,1.0,40454.0,26.0,217.0,1.0
1,2.0,33536.0,26.0,183.0,0.0
2,3.0,38294.0,26.0,27.0,1.0
3,4.0,28619.0,152.0,203.0,0.0
4,5.0,27496.0,152.0,39.0,0.0
...,...,...,...,...,...
381104,381105.0,30170.0,26.0,88.0,0.0
381105,381106.0,40016.0,152.0,131.0,0.0
381106,381107.0,35118.0,160.0,161.0,0.0
381107,381108.0,44617.0,124.0,74.0,0.0
381108,381109.0,41777.0,26.0,237.0,0.0

# 2. Checking and Cleaning Data Quality:

## i. Null values

### Generate a summary of count of all the null values column wise

In [ ]:
df1.head(2)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No

In [ ]:
df1.isnull().sum()

customer_id                386
Gender                     368
age                        368
driving licence present    393
region code                392
previously insured         381
vehicle age                381
vehicle damge              407
dtype: int64

In [ ]:
df2.isnull().sum()

customer_id                387
annual premimum (in Rs)    346
sales channel code         400
vintage                    388
response                   361
dtype: int64

### Drop Null values for customer_id because central tendencies for idâ€™s is not feasible.

In [ ]:
df1.dropna(subset=['customer_id'],inplace=True)

In [ ]:
df2.dropna(subset=['customer_id'],inplace=True)

### Replace all null values for numeric columns by mean.

In [ ]:
df1.age.fillna(df1.age.mean(),inplace = True)

In [ ]:
df2['annual premimum (in Rs)'].fillna(df2['annual premimum (in Rs)'].mean(),inplace=True)

### Replace all null values for Categorical value by mode.

In [ ]:
df1.head(5)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No

In [ ]:
df1.Gender.fillna(df1.Gender.mode().iloc[0],inplace=True)

In [ ]:
df1['driving licence present'].fillna(df1['driving licence present'].mode().iloc[0],inplace=True)

In [ ]:
df1['region code'].fillna(df1['region code'].mode().iloc[0],inplace=True)

In [ ]:
df1['previously insured'].fillna(df1['previously insured'].mode().iloc[0],inplace=True)

In [ ]:
df1['vehicle age'].fillna(df1['vehicle age'].mode().iloc[0],inplace=True)

In [ ]:
df1['vehicle damge'].fillna(df1['vehicle damge'].mode().iloc[0],inplace=True)

In [ ]:
df1.isnull().sum()

customer_id                0
Gender                     0
age                        0
driving licence present    0
region code                0
previously insured         0
vehicle age                0
vehicle damge              0
dtype: int64

In [ ]:
df2.head(5)

   customer_id  annual premimum (in Rs)  sales channel code  vintage  response
0          1.0                  40454.0                26.0    217.0       1.0
1          2.0                  33536.0                26.0    183.0       0.0
2          3.0                  38294.0                26.0     27.0       1.0
3          4.0                  28619.0               152.0    203.0       0.0
4          5.0                  27496.0               152.0     39.0       0.0

In [ ]:
df2['sales channel code'].fillna(df2['sales channel code'].mode().iloc[0],inplace=True)

In [ ]:
df2['vintage'].fillna(df2['vintage'].mode().iloc[0],inplace=True)

In [ ]:
df2['response'].fillna(df2['response'].mode().iloc[0],inplace=True)

In [ ]:
df2.isnull().sum()

customer_id                0
annual premimum (in Rs)    0
sales channel code         0
vintage                    0
response                   0
dtype: int64

## ii. Outliers

### Generate a summary of count of all the outliers column wise

In [ ]:
df1.head(5)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No

In [ ]:
df1['age'].describe()

count    380723.000000
mean         38.822788
std          15.504826
min          20.000000
25%          25.000000
50%          36.000000
75%          49.000000
max          85.000000
Name: age, dtype: float64

In [ ]:
# for age
Q1=df1['age'].describe().iloc[4]
Q3=df1['age'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

df1[(df1['age'] > upper_limit) | (df1['age'] < lower_limit)].count().sum()

0

In [ ]:
# for region code
Q1=df1['region code'].describe().iloc[4]
Q3=df1['region code'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

df1[(df1['region code'] > upper_limit) | (df1['region code'] < lower_limit)].count().sum()

0

In [ ]:
df2.head(5)

   customer_id  annual premimum (in Rs)  sales channel code  vintage  response
0          1.0                  40454.0                26.0    217.0       1.0
1          2.0                  33536.0                26.0    183.0       0.0
2          3.0                  38294.0                26.0     27.0       1.0
3          4.0                  28619.0               152.0    203.0       0.0
4          5.0                  27496.0               152.0     39.0       0.0

In [ ]:
# for annual premimum (in Rs)
Q1=df2['annual premimum (in Rs)'].describe().iloc[4]
Q3=df2['annual premimum (in Rs)'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

df2[(df2['annual premimum (in Rs)'] > upper_limit) | (df2['annual premimum (in Rs)'] < lower_limit)].count().sum()

51660

In [ ]:
# for sales channel code
Q1=df2['sales channel code'].describe().iloc[4]
Q3=df2['sales channel code'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

df2[(df2['sales channel code'] > upper_limit) | (df2['sales channel code'] < lower_limit)].count().sum()

0

In [ ]:
# for vintage
Q1=df2['vintage'].describe().iloc[4]
Q3=df2['vintage'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

df2[(df2['vintage'] > upper_limit) | (df2['vintage'] < lower_limit)].count().sum()

0

### Replace all outlier values for numeric columns by mean.

In [ ]:
# only in customer policy details we have outliers for annual premimum (in Rs) column

# for annual premimum (in Rs)
Q1=df2['annual premimum (in Rs)'].describe().iloc[4]
Q3=df2['annual premimum (in Rs)'].describe().iloc[6]

IQR = Q3-Q1

lower_limit = Q1-1.5*IQR
upper_limit = Q3+1.5*IQR

mean = df2['annual premimum (in Rs)'][(df2['annual premimum (in Rs)'] <= upper_limit) & (df2['annual premimum (in Rs)'] >= lower_limit)].mean()

df2.loc[(df2['annual premimum (in Rs)'] > upper_limit) | (df2['annual premimum (in Rs)'] < lower_limit),'annual premimum (in Rs)'] = mean

## iii. White spaces

### Remove white spaces

In [ ]:
df1.columns

Index(['customer_id', 'Gender', 'age', 'driving licence present',
       'region code', 'previously insured', 'vehicle age', 'vehicle damge'],
      dtype='object')

In [ ]:
df2.columns

Index(['customer_id', 'annual premimum (in Rs)', 'sales channel code',
       'vintage', 'response'],
      dtype='object')

In [ ]:
df1 = df1.applymap(lambda x: x.strip() if isinstance(x, str) else x)

In [ ]:
df2 = df2.applymap(lambda x: x.strip() if isinstance(x, str) else x)

### iv. case correction(lower or upper, any one)

In [ ]:
# converting into lower case

df1 = df1.apply(lambda x: x.str.lower() if x.dtype == 'object' else x)

In [ ]:
df1.head(2)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge
0,1.0,male,44.0,1.0,28.0,0.0,> 2 years,yes
1,2.0,male,76.0,1.0,3.0,0.0,1-2 year,no

In [ ]:

df2 = df2.apply(lambda x: x.str.lower() if x.dtype == 'object' else x)

In [ ]:
df2.head(2)

   customer_id  annual premimum (in Rs)  sales channel code  vintage  response
0          1.0                  40454.0                26.0    217.0       1.0
1          2.0                  33536.0                26.0    183.0       0.0

### v. Convert nominal data (categorical) into dummies

##### for future modeling use if required

In [ ]:
df1_dummies = pd.get_dummies(df1[['Gender','vehicle age','vehicle damge']],prefix=['gender','age','damge'])

In [ ]:
df1 = pd.concat([df1,df1_dummies],axis=1)

In [ ]:
df1.head(2)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damge,gender_female,gender_male,age_1-2 year,age_< 1 year,age_> 2 years,damge_no,damge_yes
0,1.0,male,44.0,1.0,28.0,0.0,> 2 years,yes,0,1,0,0,1,0,1
1,2.0,male,76.0,1.0,3.0,0.0,1-2 year,no,0,1,1,0,0,1,0

In [ ]:
df1=df1.drop(['Gender','vehicle age','vehicle damge'],axis=1)

In [ ]:
df1.head(2)

,customer_id,age,driving licence present,region code,previously insured,gender_female,gender_male,age_1-2 year,age_< 1 year,age_> 2 years,damge_no,damge_yes
0,1.0,44.0,1.0,28.0,0.0,0,1,0,0,1,0,1
1,2.0,76.0,1.0,3.0,0.0,0,1,1,0,0,1,0

In [ ]:
# There is no categorical data in df2

### vi. Drop Duplicates (duplicated rows)

In [ ]:
df1.duplicated().value_counts() # So there is no duplicated in df1

False    380723
dtype: int64

In [ ]:
df2.duplicated().value_counts() #  so there is no duplicated in df2

False    380722
dtype: int64

## 3. Create a Master table for future use. Join the customer table and customer_policy table to get a master table using customer_id in both tables.

(Hint: use pd.merge() function)

In [ ]:
df = pd.merge(df1,df2,on='customer_id')

In [ ]:
df

,customer_id,age,driving licence present,region code,previously insured,gender_female,gender_male,age_1-2 year,age_< 1 year,age_> 2 years,damge_no,damge_yes,annual premimum (in Rs),sales channel code,vintage,response
0,1.0,44.0,1.0,28.0,0.0,0,1,0,0,1,0,1,40454.0,26.0,217.0,1.0
1,2.0,76.0,1.0,3.0,0.0,0,1,1,0,0,1,0,33536.0,26.0,183.0,0.0
2,3.0,47.0,1.0,28.0,0.0,0,1,0,0,1,0,1,38294.0,26.0,27.0,1.0
3,4.0,21.0,1.0,11.0,1.0,0,1,0,1,0,1,0,28619.0,152.0,203.0,0.0
4,5.0,29.0,1.0,41.0,1.0,1,0,0,1,0,1,0,27496.0,152.0,39.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
380331,381105.0,74.0,1.0,26.0,1.0,0,1,1,0,0,1,0,30170.0,26.0,88.0,0.0
380332,381106.0,30.0,1.0,37.0,1.0,0,1,0,1,0,1,0,40016.0,152.0,131.0,0.0
380333,381107.0,21.0,1.0,30.0,1.0,0,1,0,1,0,1,0,35118.0,160.0,161.0,0.0
380334,381108.0,68.0,1.0,14.0,0.0,1,0,0,0,1,0,1,44617.0,124.0,74.0,0.0
380335,381109.0,46.0,1.0,29.0,0.0,0,1,1,0,0,1,0,41777.0,26.0,237.0,0.0

## 4. Company needs some important information from the master table to make decisions for future growth.They needs following information:

### i. Gender wise average annual premium

In [ ]:
df.head(2)

,customer_id,age,driving licence present,region code,previously insured,gender_female,gender_male,age_1-2 year,age_< 1 year,age_> 2 years,damge_no,damge_yes,annual premimum (in Rs),sales channel code,vintage,response
0,1.0,44.0,1.0,28.0,0.0,0,1,0,0,1,0,1,40454.0,26.0,217.0,1.0
1,2.0,76.0,1.0,3.0,0.0,0,1,1,0,0,1,0,33536.0,26.0,183.0,0.0

In [ ]:
Avg_male=df.groupby('gender_male').mean()['annual premimum (in Rs)'].loc[1]
Avg_female = df.groupby('gender_male').mean()['annual premimum (in Rs)'].loc[0]

print('Avg annual premium in males is :',Avg_male)
print('Avg annual premim in females is :',Avg_female)

Avg annual premium in males is : 29286.654235619575
Avg annual premim in females is : 29239.624914862074

### ii. Age wise average annual premium

In [ ]:
df.head(1)

,customer_id,age,driving licence present,region code,previously insured,gender_female,gender_male,age_1-2 year,age_< 1 year,age_> 2 years,damge_no,damge_yes,annual premimum (in Rs),sales channel code,vintage,response
0,1.0,44.0,1.0,28.0,0.0,0,1,0,0,1,0,1,40454.0,26.0,217.0,1.0

In [ ]:
df.groupby('age').mean()['annual premimum (in Rs)']

age
20.0    26324.927126
21.0    29728.666412
22.0    29922.466484
23.0    29814.386179
24.0    30097.536802
            ...
81.0    29218.279627
82.0    36435.766196
83.0    28936.737259
84.0    35440.818182
85.0    26519.292700
Name: annual premimum (in Rs), Length: 67, dtype: float64

### iii. Is your data balanced between the genders?

          (Hint: Data is balanced if number of counts in each group is approximately same)

In [ ]:
df['gender_male'].value_counts()

1    205851
0    174485
Name: gender_male, dtype: int64

In [ ]:
df['gender_female'].value_counts()

0    205851
1    174485
Name: gender_female, dtype: int64

In [ ]:
# Yes data is balanced between the genders

### iv. Vehicle age wise average annual premium.

In [ ]:
df.groupby(['age_< 1 year','age_1-2 year','age_> 2 years'],).mean()['annual premimum (in Rs)']

age_< 1 year  age_1-2 year  age_> 2 years
0             0             1                32863.929198
              1             0                29062.337122
1             0             0                29162.582810
Name: annual premimum (in Rs), dtype: float64

## 5. Is there any relation between Person Age and annual premium?

Hint: use correlation function (Correlation describes the relationship between two variables).

Correlation coefficient < -0.5           - Strong negative relationship

Correlation coefficient > 0.5            -  Strong positive relationship

0.5 < Correlation coefficient < 0.5   - There is no relationship.

In [ ]:
df['annual premimum (in Rs)'].corr(df['age'])

0.049805831054697394

In [ ]:
# corrlation of person age and annual premium is 0.04 so, where will no relationship b/w this two columns